In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "name":['harry', 'rohan', 'skillf','shubh'],
    "marks":[93, 55, 66, 65],
    "city":['rampur','kolkata','bareilly', 'antarctica']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks        city
0   harry     93      rampur
1   rohan     55     kolkata
2  skillf     66    bareilly
3   shubh     65  antarctica

In [5]:
df.to_csv('Pandas_tut.csv')

In [6]:
df.to_csv('pandas.csv', index=False)

In [7]:
df.head(2)

    name  marks     city
0  harry     93   rampur
1  rohan     55  kolkata

In [8]:
df.tail(2)

     name  marks        city
2  skillf     66    bareilly
3   shubh     65  antarctica

In [9]:
df.describe()

           marks
count   4.000000
mean   69.750000
std    16.276261
min    55.000000
25%    62.500000
50%    65.500000
75%    72.750000
max    93.000000

In [10]:
harry = pd.read_csv('pdddd.csv')

In [11]:
harry

   Train No  speed        city
0    445666     93      rampur
1     55554     55     kolkata
2     33566     66    bareilly
3     56754     65  antarctica

In [12]:
harry['speed']

0    93
1    55
2    66
3    65
Name: speed, dtype: int64

In [13]:
harry['speed'][2]

66

In [14]:
harry['speed'][2] = 123

C:\Users\majaz\AppData\Local\Temp\ipykernel_6456\1690926797.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['speed'][2] = 123

In [15]:
harry

   Train No  speed        city
0    445666     93      rampur
1     55554     55     kolkata
2     33566    123    bareilly
3     56754     65  antarctica

In [16]:
harry.to_csv('harry.csv')

In [17]:
harry

   Train No  speed        city
0    445666     93      rampur
1     55554     55     kolkata
2     33566    123    bareilly
3     56754     65  antarctica

In [18]:
harry.index = ['first','second','third','fourth']

In [19]:
harry

        Train No  speed        city
first     445666     93      rampur
second     55554     55     kolkata
third      33566    123    bareilly
fourth     56754     65  antarctica

In [20]:
ser = pd.Series(np.random.rand(34))

In [21]:
ser

0     0.326643
1     0.032291
2     0.452072
3     0.486681
4     0.864327
5     0.967869
6     0.493171
7     0.088011
8     0.137951
9     0.800634
10    0.696578
11    0.673712
12    0.696535
13    0.809778
14    0.747971
15    0.991085
16    0.701029
17    0.253007
18    0.950629
19    0.132263
20    0.858662
21    0.567460
22    0.829295
23    0.846633
24    0.886614
25    0.445933
26    0.381914
27    0.499383
28    0.878956
29    0.106083
30    0.613171
31    0.221393
32    0.541321
33    0.949990
dtype: float64

In [22]:
ser.dtype

dtype('float64')

In [23]:
type(ser)

pandas.core.series.Series

In [24]:
newdf = pd.DataFrame(np.random.rand(345,6), index = np.arange(345))

In [25]:
newdf

            0         1         2         3         4         5
0    0.799244  0.218357  0.274310  0.712697  0.436879  0.205816
1    0.286656  0.423568  0.385571  0.037682  0.866443  0.903402
2    0.074588  0.376454  0.096460  0.767991  0.008418  0.034659
3    0.214111  0.856134  0.537431  0.048293  0.729606  0.558344
4    0.139330  0.851859  0.995929  0.273551  0.943711  0.829524
..        ...       ...       ...       ...       ...       ...
340  0.603521  0.680530  0.976339  0.657338  0.959638  0.763429
341  0.075359  0.196277  0.389242  0.280223  0.376830  0.209008
342  0.239132  0.897138  0.817838  0.841090  0.119957  0.350822
343  0.085939  0.152579  0.647957  0.920326  0.769800  0.426649
344  0.057908  0.004450  0.865449  0.528219  0.146114  0.123223

[345 rows x 6 columns]

In [26]:
newdf.describe()

                0           1           2           3           4           5
count  345.000000  345.000000  345.000000  345.000000  345.000000  345.000000
mean     0.486646    0.502179    0.512397    0.504515    0.523085    0.526886
std      0.295057    0.289263    0.299413    0.289862    0.288270    0.281171
min      0.001004    0.002690    0.000454    0.001088    0.002361    0.004354
25%      0.236734    0.250629    0.256424    0.271385    0.273374    0.305398
50%      0.478627    0.489944    0.525393    0.492718    0.536867    0.549396
75%      0.747814    0.759970    0.790043    0.775983    0.773374    0.776450
max      0.991939    0.998099    0.999733    0.998794    0.996924    0.999988

In [27]:
newdf.head()

          0         1         2         3         4         5
0  0.799244  0.218357  0.274310  0.712697  0.436879  0.205816
1  0.286656  0.423568  0.385571  0.037682  0.866443  0.903402
2  0.074588  0.376454  0.096460  0.767991  0.008418  0.034659
3  0.214111  0.856134  0.537431  0.048293  0.729606  0.558344
4  0.139330  0.851859  0.995929  0.273551  0.943711  0.829524

In [28]:
newdf[0][0] = 'harry'

In [29]:
newdf

            0         1         2         3         4         5
0       harry  0.218357  0.274310  0.712697  0.436879  0.205816
1    0.286656  0.423568  0.385571  0.037682  0.866443  0.903402
2    0.074588  0.376454  0.096460  0.767991  0.008418  0.034659
3    0.214111  0.856134  0.537431  0.048293  0.729606  0.558344
4     0.13933  0.851859  0.995929  0.273551  0.943711  0.829524
..        ...       ...       ...       ...       ...       ...
340  0.603521  0.680530  0.976339  0.657338  0.959638  0.763429
341  0.075359  0.196277  0.389242  0.280223  0.376830  0.209008
342  0.239132  0.897138  0.817838  0.841090  0.119957  0.350822
343  0.085939  0.152579  0.647957  0.920326  0.769800  0.426649
344  0.057908  0.004450  0.865449  0.528219  0.146114  0.123223

[345 rows x 6 columns]

In [30]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
5    float64
dtype: object

In [31]:
newdf.head()

          0         1         2         3         4         5
0     harry  0.218357  0.274310  0.712697  0.436879  0.205816
1  0.286656  0.423568  0.385571  0.037682  0.866443  0.903402
2  0.074588  0.376454  0.096460  0.767991  0.008418  0.034659
3  0.214111  0.856134  0.537431  0.048293  0.729606  0.558344
4   0.13933  0.851859  0.995929  0.273551  0.943711  0.829524

In [32]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            335, 336, 337, 338, 339, 340, 341, 342, 343, 344],
           dtype='int64', length=345)

In [33]:
newdf.columns

RangeIndex(start=0, stop=6, step=1)

In [34]:
newdf.to_numpy()

array([['harry', 0.2183571408773869, 0.27431019460272243,
        0.7126971473076015, 0.4368787204046457, 0.20581616350725007],
       [0.28665592922580785, 0.4235678866094549, 0.38557082187845715,
        0.037682018032044295, 0.8664425299541719, 0.9034017078310788],
       [0.07458818741950068, 0.3764538870367463, 0.09645981327876352,
        0.76799097752881, 0.008417674415623466, 0.03465876162425452],
       ...,
       [0.2391323100406122, 0.8971375693380758, 0.817837781873332,
        0.8410900699334767, 0.11995663779345511, 0.35082164887730627],
       [0.08593870827711358, 0.15257851300271175, 0.6479565794130562,
        0.9203264301959079, 0.769800206632452, 0.426648570733667],
       [0.05790780291948816, 0.004450289851001599, 0.8654494801768798,
        0.528218887774767, 0.1461142938577492, 0.12322279270333858]],
      dtype=object)

In [35]:
newdf[0][0] = 35

In [36]:
newdf

            0         1         2         3         4         5
0          35  0.218357  0.274310  0.712697  0.436879  0.205816
1    0.286656  0.423568  0.385571  0.037682  0.866443  0.903402
2    0.074588  0.376454  0.096460  0.767991  0.008418  0.034659
3    0.214111  0.856134  0.537431  0.048293  0.729606  0.558344
4     0.13933  0.851859  0.995929  0.273551  0.943711  0.829524
..        ...       ...       ...       ...       ...       ...
340  0.603521  0.680530  0.976339  0.657338  0.959638  0.763429
341  0.075359  0.196277  0.389242  0.280223  0.376830  0.209008
342  0.239132  0.897138  0.817838  0.841090  0.119957  0.350822
343  0.085939  0.152579  0.647957  0.920326  0.769800  0.426649
344  0.057908  0.004450  0.865449  0.528219  0.146114  0.123223

[345 rows x 6 columns]

In [37]:
newdf.head()

          0         1         2         3         4         5
0        35  0.218357  0.274310  0.712697  0.436879  0.205816
1  0.286656  0.423568  0.385571  0.037682  0.866443  0.903402
2  0.074588  0.376454  0.096460  0.767991  0.008418  0.034659
3  0.214111  0.856134  0.537431  0.048293  0.729606  0.558344
4   0.13933  0.851859  0.995929  0.273551  0.943711  0.829524

In [38]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,335,336,337,338,339,340,341,342,343,344
0,35,0.286656,0.074588,0.214111,0.13933,0.387777,0.508547,0.719995,0.102935,0.24395,...,0.973165,0.060399,0.533485,0.981493,0.952296,0.603521,0.075359,0.239132,0.085939,0.057908
1,0.218357,0.423568,0.376454,0.856134,0.851859,0.357869,0.553494,0.270718,0.497448,0.316674,...,0.943937,0.991325,0.491295,0.372879,0.893775,0.68053,0.196277,0.897138,0.152579,0.00445
2,0.27431,0.385571,0.09646,0.537431,0.995929,0.15175,0.667814,0.290089,0.15496,0.789953,...,0.175703,0.849035,0.453927,0.472232,0.000454,0.976339,0.389242,0.817838,0.647957,0.865449
3,0.712697,0.037682,0.767991,0.048293,0.273551,0.580508,0.571076,0.271385,0.104582,0.411752,...,0.458291,0.038622,0.049731,0.285571,0.919842,0.657338,0.280223,0.84109,0.920326,0.528219
4,0.436879,0.866443,0.008418,0.729606,0.943711,0.699898,0.821335,0.42769,0.031625,0.384884,...,0.469601,0.478919,0.937419,0.963314,0.505221,0.959638,0.37683,0.119957,0.7698,0.146114
5,0.205816,0.903402,0.034659,0.558344,0.829524,0.76102,0.060589,0.83616,0.487734,0.136089,...,0.809105,0.747834,0.205982,0.77853,0.846537,0.763429,0.209008,0.350822,0.426649,0.123223

In [39]:
newdf.head()

          0         1         2         3         4         5
0        35  0.218357  0.274310  0.712697  0.436879  0.205816
1  0.286656  0.423568  0.385571  0.037682  0.866443  0.903402
2  0.074588  0.376454  0.096460  0.767991  0.008418  0.034659
3  0.214111  0.856134  0.537431  0.048293  0.729606  0.558344
4   0.13933  0.851859  0.995929  0.273551  0.943711  0.829524

In [40]:
newdf.sort_index(axis=1, ascending = False)

            5         4         3         2         1         0
0    0.205816  0.436879  0.712697  0.274310  0.218357        35
1    0.903402  0.866443  0.037682  0.385571  0.423568  0.286656
2    0.034659  0.008418  0.767991  0.096460  0.376454  0.074588
3    0.558344  0.729606  0.048293  0.537431  0.856134  0.214111
4    0.829524  0.943711  0.273551  0.995929  0.851859   0.13933
..        ...       ...       ...       ...       ...       ...
340  0.763429  0.959638  0.657338  0.976339  0.680530  0.603521
341  0.209008  0.376830  0.280223  0.389242  0.196277  0.075359
342  0.350822  0.119957  0.841090  0.817838  0.897138  0.239132
343  0.426649  0.769800  0.920326  0.647957  0.152579  0.085939
344  0.123223  0.146114  0.528219  0.865449  0.004450  0.057908

[345 rows x 6 columns]

In [41]:
newdf.head()

          0         1         2         3         4         5
0        35  0.218357  0.274310  0.712697  0.436879  0.205816
1  0.286656  0.423568  0.385571  0.037682  0.866443  0.903402
2  0.074588  0.376454  0.096460  0.767991  0.008418  0.034659
3  0.214111  0.856134  0.537431  0.048293  0.729606  0.558344
4   0.13933  0.851859  0.995929  0.273551  0.943711  0.829524

In [42]:
newdf[0]

0            35
1      0.286656
2      0.074588
3      0.214111
4       0.13933
         ...
340    0.603521
341    0.075359
342    0.239132
343    0.085939
344    0.057908
Name: 0, Length: 345, dtype: object

In [43]:
type(newdf[0])

pandas.core.series.Series

In [44]:
newdf3 = newdf

In [45]:
newdf3[0][0] = 455666

In [46]:
newdf

            0         1         2         3         4         5
0      455666  0.218357  0.274310  0.712697  0.436879  0.205816
1    0.286656  0.423568  0.385571  0.037682  0.866443  0.903402
2    0.074588  0.376454  0.096460  0.767991  0.008418  0.034659
3    0.214111  0.856134  0.537431  0.048293  0.729606  0.558344
4     0.13933  0.851859  0.995929  0.273551  0.943711  0.829524
..        ...       ...       ...       ...       ...       ...
340  0.603521  0.680530  0.976339  0.657338  0.959638  0.763429
341  0.075359  0.196277  0.389242  0.280223  0.376830  0.209008
342  0.239132  0.897138  0.817838  0.841090  0.119957  0.350822
343  0.085939  0.152579  0.647957  0.920326  0.769800  0.426649
344  0.057908  0.004450  0.865449  0.528219  0.146114  0.123223

[345 rows x 6 columns]

In [47]:
newdf3 = newdf.copy() #newdf3 = newdf.copy() #

In [48]:
newdf3[0][1] = 334455666

C:\Users\majaz\AppData\Local\Temp\ipykernel_6456\4073222975.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf3[0][1] = 334455666

In [49]:
newdf

            0         1         2         3         4         5
0      455666  0.218357  0.274310  0.712697  0.436879  0.205816
1    0.286656  0.423568  0.385571  0.037682  0.866443  0.903402
2    0.074588  0.376454  0.096460  0.767991  0.008418  0.034659
3    0.214111  0.856134  0.537431  0.048293  0.729606  0.558344
4     0.13933  0.851859  0.995929  0.273551  0.943711  0.829524
..        ...       ...       ...       ...       ...       ...
340  0.603521  0.680530  0.976339  0.657338  0.959638  0.763429
341  0.075359  0.196277  0.389242  0.280223  0.376830  0.209008
342  0.239132  0.897138  0.817838  0.841090  0.119957  0.350822
343  0.085939  0.152579  0.647957  0.920326  0.769800  0.426649
344  0.057908  0.004450  0.865449  0.528219  0.146114  0.123223

[345 rows x 6 columns]

In [50]:
newdf.loc[0,0] = 456

In [51]:
newdf.head(2)

          0         1         2         3         4         5
0       456  0.218357  0.274310  0.712697  0.436879  0.205816
1  0.286656  0.423568  0.385571  0.037682  0.866443  0.903402

In [52]:
newdf.head()

          0         1         2         3         4         5
0       456  0.218357  0.274310  0.712697  0.436879  0.205816
1  0.286656  0.423568  0.385571  0.037682  0.866443  0.903402
2  0.074588  0.376454  0.096460  0.767991  0.008418  0.034659
3  0.214111  0.856134  0.537431  0.048293  0.729606  0.558344
4   0.13933  0.851859  0.995929  0.273551  0.943711  0.829524

In [53]:
newdf.drop(5, axis=1).head()

          0         1         2         3         4
0       456  0.218357  0.274310  0.712697  0.436879
1  0.286656  0.423568  0.385571  0.037682  0.866443
2  0.074588  0.376454  0.096460  0.767991  0.008418
3  0.214111  0.856134  0.537431  0.048293  0.729606
4   0.13933  0.851859  0.995929  0.273551  0.943711

In [54]:
newdf.head()

          0         1         2         3         4         5
0       456  0.218357  0.274310  0.712697  0.436879  0.205816
1  0.286656  0.423568  0.385571  0.037682  0.866443  0.903402
2  0.074588  0.376454  0.096460  0.767991  0.008418  0.034659
3  0.214111  0.856134  0.537431  0.048293  0.729606  0.558344
4   0.13933  0.851859  0.995929  0.273551  0.943711  0.829524

In [55]:
newdf.loc[[0,1],[3,5]]

          3         5
0  0.712697  0.205816
1  0.037682  0.903402

In [56]:
newdf.loc[:,[3,5]].head()

          3         5
0  0.712697  0.205816
1  0.037682  0.903402
2  0.767991  0.034659
3  0.048293  0.558344
4  0.273551  0.829524

In [57]:
newdf.loc[(newdf[2] < 0.3) & (newdf[4] > 0.1)].head()

           0         1         2         3         4         5
0        456  0.218357  0.274310  0.712697  0.436879  0.205816
5   0.387777  0.357869  0.151750  0.580508  0.699898  0.761020
7   0.719995  0.270718  0.290089  0.271385  0.427690  0.836160
11  0.281875  0.292723  0.146195  0.133095  0.606538  0.513727
13  0.185756  0.170366  0.297588  0.262207  0.935781  0.863259

In [58]:
newdf.iloc[0,4] #loc is used to pick using index name but iloc is used to pick the element using index no.

0.4368787204046457

In [59]:
newdf.drop([2,4], axis=1, inplace= True) #inplce is used to delete row or column permanently   inplace= True

In [60]:
newdf.head()

          0         1         3         5
0       456  0.218357  0.712697  0.205816
1  0.286656  0.423568  0.037682  0.903402
2  0.074588  0.376454  0.767991  0.034659
3  0.214111  0.856134  0.048293  0.558344
4   0.13933  0.851859  0.273551  0.829524

In [61]:
newdf.reset_index(drop=True, inplace= True)

In [62]:
newdf.isnull()

         0      1      3      5
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
340  False  False  False  False
341  False  False  False  False
342  False  False  False  False
343  False  False  False  False
344  False  False  False  False

[345 rows x 4 columns]

In [63]:
newdf.head()

          0         1         3         5
0       456  0.218357  0.712697  0.205816
1  0.286656  0.423568  0.037682  0.903402
2  0.074588  0.376454  0.767991  0.034659
3  0.214111  0.856134  0.048293  0.558344
4   0.13933  0.851859  0.273551  0.829524

In [64]:
newdf.loc[:,[1]] = None

In [65]:
newdf

            0     1         3         5
0         456  None  0.712697  0.205816
1    0.286656  None  0.037682  0.903402
2    0.074588  None  0.767991  0.034659
3    0.214111  None  0.048293  0.558344
4     0.13933  None  0.273551  0.829524
..        ...   ...       ...       ...
340  0.603521  None  0.657338  0.763429
341  0.075359  None  0.280223  0.209008
342  0.239132  None  0.841090  0.350822
343  0.085939  None  0.920326  0.426649
344  0.057908  None  0.528219  0.123223

[345 rows x 4 columns]

In [66]:
newdf.isnull()

         0     1      3      5
0    False  True  False  False
1    False  True  False  False
2    False  True  False  False
3    False  True  False  False
4    False  True  False  False
..     ...   ...    ...    ...
340  False  True  False  False
341  False  True  False  False
342  False  True  False  False
343  False  True  False  False
344  False  True  False  False

[345 rows x 4 columns]

In [67]:
df11 = pd.DataFrame({"name":['alfred','batman', np.nan],
                  "toy":[np.nan,'batmobile','bullwhip'],
                  "born":[pd.NaT,pd.Timestamp("1940-04-25"),pd.NaT]})

In [68]:
df11.head()

     name        toy       born
0  alfred        NaN        NaT
1  batman  batmobile 1940-04-25
2     NaN   bullwhip        NaT

In [69]:
df11.dropna(how='all') # if only dropna is run all the data having atleast one na is removed from dataset.

     name        toy       born
0  alfred        NaN        NaT
1  batman  batmobile 1940-04-25
2     NaN   bullwhip        NaT

In [70]:
df11.drop_duplicates(subset=['name'])

     name        toy       born
0  alfred        NaN        NaT
1  batman  batmobile 1940-04-25
2     NaN   bullwhip        NaT

In [71]:
df11.head()

     name        toy       born
0  alfred        NaN        NaT
1  batman  batmobile 1940-04-25
2     NaN   bullwhip        NaT

In [72]:
df11.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    2 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [73]:
df11['name'].value_counts(dropna=True)

alfred    1
batman    1
Name: name, dtype: int64

In [74]:
df11.notnull()

    name    toy   born
0   True  False  False
1   True   True   True
2  False   True  False